export default {
	translation: {
		page: {
			title: 'Давид Сцицлуна • Портфолио',
			description:
				'Здраво! Ја сам Давид Сцицлуна, предњи девелопер са седиштем на сунчаним малтешким острвима. Тренутно ради у Таин-у | Еезе и као фрееланцер. Веома сам страствен у технологији; Волим развијање идеја у апликације и посвећен сам стварању производа и услуга са изузетним корисничким искуством и са модерним техникама корисничког интерфејса. Трудим се да наставим да учим и ширим своје знање у овој области, јер верујем да ће то више научити, то ће све искуство имати крајњи корисници. Можете ме пронаћи на ЛинкедИн-у и ГитХуб-у или ми се досегнете путем е-маила на хелло@давидсцицлуна.цом.'
		},
		common: {
			about: [
				`Здраво! Ја сам Давид Сцицлуна, предњи девелопер са седиштем на сунчаним малтешким острвима. Тренутно ради на <a href="${
					import.meta.env.VITE_TAIN_URL
				}" target="_blank">Tain</a> | <a href="${
					import.meta.env.VITE_EEZE_URL
				}" target="_blank">EEZE</a> и као фрееланцер.`,
				'Веома сам страствен у технологији; Волим развијање идеја у апликације и посвећен сам стварању производа и услуга са изузетним корисничким искуством и са модерним техникама корисничког интерфејса.',
				'Трудим се да наставим да учим и ширим своје знање у овој области, јер верујем да ће то више научити, то ће све искуство имати крајњи корисници.',
				`Можете ме наћи на <a href="${
					import.meta.env.VITE_LINKEDIN_URL
				}" target="_blank">Linkedin</a> и <a href="${
					import.meta.env.VITE_GITHUB_URL
				}" target="_blank">Github</a> или ми се досегне путем е-поште на <a href="mailto:${
					import.meta.env.VITE_EMAIL_URL
				}">hello@davidscicluna.com</a>.`
			],
			navItems: { '/': 'Кућа', '/about': 'О томе', '/projects': 'Пројекти' },
			projects: {
				edb: {
					title: 'База за забаву (ЕДБ)',
					short: 'Укрстити',
					description:
						'База података за забаву (ЕДБ) је веб апликација која нуди информације везане за индустрију забаве коју покреће ТхеовиедБ АПИ. Такве информације могу бити било шта из филмова, ТВ емисија и људи који то чине. ЕДБ нуди корисницима могућност прегледавања свих информација, као и сачува и сачувати у списак. Сваки податак који се налазе у ЕДБ-у је најновији и најпопуларнији садржај који се тичу забавне индустрије, обезбеђујући кориснике са поузданим садржајем.',
					links: { web: 'Иди на Едб', playground: 'Отвори ЕДБ', git: 'Гитхуб' }
				},
				concentration: {
					title: 'Концентрација',
					description:
						'Концентрација је карта одговарајуће утакмице. Да би победио, играч мора да одговара свим картицама упаривањем оних који садрже исту икону.',
					links: { web: 'Ићи у концентрацију', playground: 'Отворена концентрација', git: 'Гитхуб' }
				},
				journal: {
					title: 'Часопис',
					description:
						'Часопис је богат уредник текста који омогућава кориснику да пише и уређује белешке са текстом, сликама, везама и бојама.',
					links: { web: 'Иди у часопис', playground: 'Отворен часопис', git: 'Гитхуб' }
				},
				clock: {
					title: 'Сат',
					description:
						'Сат је апликација у реалном времену која омогућава кориснику да провери у реалном тренутку било којег града широм света. Може се подесити аларми, штоперицу и тајмер.',
					links: { web: 'Ићи на сат', playground: 'Отворен сат', git: 'Гитхуб' }
				},
				weather: {
					title: 'Време',
					description:
						'Време је апликација која омогућава кориснику да тражи тренутно време свих градова широм света.',
					links: { web: 'Ићи на време', playground: 'Отворено време', git: 'Гитхуб' }
				},
				calculator: {
					title: 'Калкулатор',
					description:
						'Калкулатор је апликација која омогућава кориснику да израчуна не-научна прорачуна и приказује прорачуне прорачуне.',
					links: { web: 'Иди на калкулатор', playground: 'Отворен калкулатор', git: 'Гитхуб' }
				}
			},
			skills: [
				{
					label: 'Дизајн',
					skills: [
						'Дизајн корисничког интерфејса (УИ)',
						'Корисничко искуство (УКС)',
						'Одговарајући веб дизајн',
						'Дизајн брендирања'
					]
				},
				{
					label: 'Технологије',
					skills: [
						'Језик хипертекста маркета (ХТМЛ)',
						'Каскадни стилски листови (ЦСС)',
						'Синтактички сјајни стилски листови (САСС)',
						'ЦСС у ЈС (ЈСС)',
						'Јавасцрипт',
						'Уписак'
					]
				},
				{ label: 'ЈС Фрамеворкс', skills: ['Реацт ЈС', 'У'] },
				{
					label: 'Библиотеке',
					skills: ['Цхакра уи', 'Материјал уи (муи)', 'Редукс', 'Нацрт ЈС', 'Књига са приповедом']
				},
				{ label: 'Тестирање', skills: ['Јест', 'Јасмине ЈС'] },
				{
					label: 'Алатке и апликације',
					skills: ['Гит', 'Пређа', 'НПМ', 'Еслинт', 'Лепљив', 'Фигма', 'Дизајн Адобе Екпериенце (КСД)']
				}
			]
		},
		components: {
			errorBoundary: {
				title: 'О, не! 😭',
				subtitle:
					'Нажалост, нешто је пошло по злу када покушава да учини захтев. Освежите поново да покушате поново!',
				console: 'Грешка у неумољивању:',
				action: 'Освјежи'
			},
			logo: { long: 'давидсцицлуна', short: 'дс' }
		},
		layout: {
			internationalizationModal: {
				title: 'Језик којем дајете предност',
				subtitle: 'Изаберите жељени језик по вашем избору са листе језика у наставку',
				languages: {
					bg: 'Бугарски',
					cs: 'Чешки',
					da: 'Дански',
					de: 'Немачки',
					el: 'Грчки',
					en: 'енглески језик',
					es: 'Шпански',
					fr: 'Француски',
					hr: 'Хрватски',
					hu: 'Мађарски',
					it: 'Италијан',
					mt: 'Малтешки',
					nl: 'Холандски',
					pl: 'Пољски',
					pt: 'Португалски',
					ro: 'Румунски језик',
					ru: 'Руски',
					sr: 'Српски',
					sv: 'Шведски',
					tr: 'Турски',
					uk: 'Украјински'
				},
				placeholder: "Пробај '{{language}}'",
				cancel: 'Поништити, отказати',
				action: 'Промените језик'
			},
			playgroundModal: {
				title: 'Назив пројекта',
				subtitle: 'Опис пројекта',
				navigation: {
					open: {
						'aria-label': { tooltip: 'Отворена навигација (Тоолтип)', button: 'Отворена навигација' },
						'tooltip': 'Отворена навигација'
					},
					close: {
						'aria-label': { tooltip: 'Изађите на навигацију (Тоолтип)', button: 'Излаз на навигацију' },
						'tooltip': 'Излаз на навигацију'
					}
				},
				fullscreen: {
					open: {
						'aria-label': { tooltip: 'Отвори пуни екран (Тоолтип)', button: 'Отвори пуни екран' },
						'tooltip': 'Отвори пуни екран'
					},
					close: {
						'aria-label': {
							tooltip: 'Изађите из пуног екрана (Тоолтип)',
							button: 'Изађите из пуног екрана'
						},
						'tooltip': 'Изађите из пуног екрана'
					}
				},
				close: { 'aria-label': 'Затвори игралиште', 'tooltip': 'Близу' },
				cancel: 'Поништити, отказати',
				action: 'Отвори на новој картици'
			},
			contact: {
				label: 'Желите да ступите у контакт да сарађујете на пројекту који имате на уму? Кликните да бисте разговарали!',
				action: 'Хајде да разговарамо'
			},
			footer: { copyright: '© {{year}} Давид Сцицлуна, сва права задржана.' },
			navigation: {
				colorModeIconButton: {
					light: {
						'aria-label': {
							tooltip: 'Пребаците се на Дарк Моде (Тоолтип)',
							button: 'Пребаците се на тамни режим'
						},
						'tooltip': 'Пребаците се на тамни режим'
					},
					dark: {
						'aria-label': {
							tooltip: 'Пређите на режим светлости (Тоолтип)',
							button: 'Пребаците се на режим светлости'
						},
						'tooltip': 'Пребаците се на режим светлости'
					}
				},
				internationalizationIconButton: {
					'aria-label': { tooltip: 'Промените језик (Тоолтип)', button: 'Промените језик' },
					'tooltip': 'Промените језик'
				},
				action: 'Ступите у контакт'
			},
			socials: {
				email: {
					'aria-label': {
						tooltip: "Пошаљите е-пошту '{{email}}' (Тоолтип)",
						button: "Пошаљите е-пошту '{{email}}'"
					},
					'tooltip': "Емаил: '{{email}}'"
				},
				linkedin: {
					'aria-label': {
						tooltip: 'Опен ЛинкедИн страница профила (Тоолтип)',
						button: 'Опен ЛинкедИн Профил паге'
					},
					'tooltip': 'ЛинкедИн профил'
				},
				github: {
					'aria-label': {
						tooltip: 'Отвори страницу профила Гитхуб (Тоолтип)',
						button: 'Отворите страницу профила ГитХуб'
					},
					'tooltip': 'ГитХуб Профиле'
				}
			}
		},
		noMatch: {
			title: 'Страница није пронађена!',
			subtitle: 'Молимо вас да проверите УРЛ адресу у адресној траци и покушајте поново.',
			action1: 'Иди назад кући',
			action2: 'Покушајте поново'
		},
		splashscreen: { label: 'Давид Сцицлуна • Предњи део програма', logo: 'давидсцицлуна' },
		home: {
			title1: 'Здраво! Ја сам Давид страствени',
			title2: 'Продорни програмер',
			subtitle: 'Тренутно седиште на сунчаним малтешким острвима',
			icons: {
				html: { 'aria-label': 'ХТМЛ (Тоолтип)', 'label': 'Хтмл' },
				css: { 'aria-label': 'ЦСС (Тоолтип)', 'label': 'ЦСС' },
				js: { 'aria-label': 'ЈаваСцрипт (Тоолтип)', 'label': 'Јавасцрипт' },
				ts: { 'aria-label': 'Тип упит (Тоолтип)', 'label': 'Уписак' },
				react: { 'aria-label': 'Реацт (Тоолтип)', 'label': 'Реагирати' }
			},
			action: 'Ступите у контакт'
		},
		about: {
			cover: {
				banner: 'Баннер',
				portrait: 'Портрет'
			},
			labels: {
				aboutMe: 'О мени',
				certifications: 'Сертификате',
				experience: 'Искуство',
				skills: 'Вештине'
			},
			experiences: [
				{ place: 'Таин | Еезе', role: 'Продорни програмер' },
				{ place: 'davidscicluna.com', role: 'Слободни предњи девелопер' },
				{ place: 'Министарство за Гозо (Канцеларија ЦИО)', role: 'Предњи девелопер (Поновни приправник)' },
				{ place: 'Министарство за Гозо (Канцеларија ЦИО)', role: 'Предњи девелопер (Поновни приправник)' },
				{
					place: 'Министарство за Гозо (Канцеларија ЦИО)',
					role: 'ИТ техничка подршка (програм са пуним радним временом)'
				}
			],
			certifications: {
				udacity: 'Предњи веб програмер нанодегрее',
				freecodecamp: 'Одговарајуће сертификат веб дизајна'
			}
		}
	}
};
